Файлы_конфигурации/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЕдиницыИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Файлы_конфигурации/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ОбращениеНаСервер(ЕдиницыИзмерения)
	   Возврат ЕдиницыИзмерения.КоэффициентЕдиницыИзмерения;
КонецФункции

&НаКлиенте
Процедура ТаблицаЕдиницыИзмеренияПриИзменении(Элемент)

	 ТекСтрока                             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.КоэффициентЕдиницыИзмерения = ОбращениеНаСервер(ТекСтрока.ЕдиницыИзмерения);
	 ТекСтрока.Количество                  = 0;
	 ТекСтрока.Цена                        = 0;
	 ТекСтрока.Сумма                       = 0;
	 Объект.СуммаДокумента                 = Объект.Таблица.Итог("Сумма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенаПриИзменении(Элемент)

	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)

	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСуммаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
     Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатураПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	//Одиночный подбор
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,Элементы.Таблица);
	
	
	//ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе",Ложь);
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Таблица);
	
	//ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Таблица);
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе", Истина, Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//ОдиночныйВыбор
	//Элементы.Таблица.ДобавитьСтроку();
	//Элементы.Таблица.ТекущиеДанные.Номенклатура = ВыбранноеЗначение;

	//МножественныйВыбор
	Для каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		
		СтруктураДляПоиска   = Новый Структура("Номенклатура", ВыбранныйЭлемент);
		НайденныйМассивСтрок = Объект.Таблица.НайтиСтроки(СтруктураДляПоиска);
	
		Если НайденныйМассивСтрок.Количество() = 0 Тогда
			НоваяСтрока              = Объект.Таблица.Добавить();
			НоваяСтрока.Номенклатура = ВыбранныйЭлемент;
			НоваяСтрока.Количество   = 1;
		Иначе
			НайденныйМассивСтрок[0].Количество = НайденныйМассивСтрок[0].Количество + 1;
		КонецЕсли;

		
	КонецЦикла;

КонецПроцедуры
